# Отчёт по лабораторной работе №21 по курсу «Языки и методы программирования»

<b>Студент группы:</b> <ins>М80-108Б-22 Иванов Андрей Кириллович, № по списку: 9</ins>

<b>Контакты e-mail:</b> <ins>andr-ushka2@yandex.ru</ins>

<b>Работа выполнена:</b> «17» <ins>марта</ins> <ins>2023</ins> г.

<b>Преподаватель:</b> <ins>асп. каф. 806 Сахарин Никита Александрович</ins>

<b>Входной контроль знаний с оценкой:</b> <ins> </ins>

<b>Отчет сдан</b> «» <ins>марта</ins> <ins>2023</ins> г., <b>итоговая оценка</b> <ins> </ins>

<b>Подпись преподавателя:</b> ___________

## 1. Тема

Программирование на интерпретируемых командных языках

## 2. Цель работы

Составить программу выполнения заданных действий над файлами на одном из интерпретируемом командном языке ОС UNIX - Bash

## 3. Задание (Вариант 10)

Cравнение указанного файла, со всеми файлами, имеющими такой же суффикс, с удалением совпадающих файлов.

## 4. Оборудование

Процессор: AMD RYZEN 7 5800H 3.20GHz ОП 16 ГБ

HDD: 952 ГБ

Монитор: 3840x2400

## 5. Программное обеспечение

Операционная система семейства: Linux Ubuntu, версия 22.04.1 LTS

Интерпретатор команд: bash, версия 5.0.17(1)

Система программирования: -

Редактор текстов: 

Местонахождение и имена файлов программ и данных на домашнем компьютере: -

## 6. Идея, метод, алгоритм решения задачи

В первом скрипте на языке bash используется команда find для поиска всех файлов с нужным суффиксом, после чего происходит сравнение каждого найденного файла с указанным файлом с помощью команды cmp. Если файлы совпадают, то найденный файл удаляется с помощью команды rm.

Во втором скрипте на языке Python используется модуль os для получения списка файлов в текущей директории, после чего происходит фильтрация списка по суффиксу. Затем каждый файл из списка сравнивается с указанным файлом по содержимому с помощью функции open. Если файлы совпадают, то найденный файл удаляется с помощью функции os.remove.




## 7. Сценарий выполнения работы

```
#!/bin/bash

# Указываем имя файла, с которым будем сравнивать
filename="example.txt"

# Получаем суффикс файла
suffix="${filename##*.}"

# Ищем все файлы с таким же суффиксом
files=$(find . -type f -name "*.$suffix")

# Проходим по каждому файлу и сравниваем его с указанным файлом
for file in $files; do
    if cmp -s "$filename" "$file"; then
        echo "Удаляем файл: $file"
        rm "$file"
    fi
done
```
```
import os


filename = "example.txt"
suffix = filename.split(".")[-1]

files = [f for f in os.listdir(".") if f.endswith(suffix)]

# Проходим по каждому файлу и сравниваем его с указанным файлом
for file in files:
    if file != filename and open(file, "rb").read() == open(filename, "rb").read():
        print("Удаляем файл:", file)
        os.remove(file)
```

**8. Распечатка протокола**

```
```

## 9. Дневник отладки

| **№** | **Лаб.Или Дом.** | **Дата** | **Время** | **Событие** | **Действие по исправлению** | **Примечание** |
| --- | --- | --- | --- | --- | --- | --- |
| **1** | **Дом.** | **25.03.23** | **13:00** | **Составление Bash-скрипта** | **-** | **-** |

## 10. Замечания автора по существу работы

## 11. Выводы

Благодаря лабораторной работе были получениы навыки работы с Bash-скриптами.Был изучен синтаксис языка Bash. Было освоено отделение префикса файла от полного его имени и вычисление размера файла на Bash 

<b>Подпись студента:</b> ___________
